shm_v2012/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

xmax    705;
xmin   -10;
ymax    110;
ymin   -110;
zmax    30;
zmin   -30;
celSize 2.5;
xcelln #calc "(($xmax)-($xmin))/$celSize";
ycelln #calc "(($ymax)-($ymin))/$celSize";
zcelln #calc "(($zmax)-($zmin))/$celSize";

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcelln $ycelln $zcelln) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

// ************************************************************************* //
